Revit 2027 API
ExternalGeometryId Properties
The ExternalGeometryId type exposes the following members.
Properties
Name | Description
Id |  External geometry identifier.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
See Also
Reference
ExternalGeometryId Class
Autodesk.Revit.DB Namespace